app/controllers/wikis_controller.rb

  def index
    @wikis = Wiki.all
---
SELECT "wikis".* FROM "wikis"

  def create
      @wiki = current_user.wikis.new(wiki_params)


     if @wiki.save
---
INSERT INTO "wikis" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "woohooo"], ["body", "see if it works"], ["user_id", 7], ["created_at", "2018-06-01 14:59:58.270088"], ["updated_at", "2018-06-01 14:59:58.270088"]]

  def update
    @wiki = Wiki.find(params[:id])
    @wiki.assign_attributes(wiki_params)

      if @wiki.save
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "wikis" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "wikis"."id" = ?

    def destroy
      @wiki = Wiki.find(params[:id])
      authorize @wiki

      if @wiki.destroy
---
SELECT  "wikis".* FROM "wikis" WHERE "wikis"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "wikis" WHERE "wikis"."id" = ?  [["id", 52]]